# 1、算数运算符
"""
1、 +  -  *  /
2、 // 整除（求商）
3、 % 取余数
4、 ** 指数，幂运算
5、 () 可以改变优先级
"""

# 2、赋值运算符： =
"""
将等号右边的数据赋值给等号左边的变量
等号左边必须是变量，不能是具体数字
"""

# 3、复合赋值运算符
"""
+=  c += a ===> c = c + a
-=  c -= a ===> c = c - a
*=  c *= a ===> c = c * a
/=  c /= a ===> c = c / a
%=  c %= a ===> c = c % a
**=  c **= a ===> c = c ** a
//=  c //= a ===> c = c // a
"""

# 4、比较运算符（结果为bool类型，即True 或者 False）
"""
==  !=  >  <  >=  <=
"""

# 5、逻辑运算符（连接两个表达式，共同决定最终结果）
"""
and 逻辑与 一假为假
    如果第一个条件为False，就不会再判断第二个条件
or 逻辑或 一真为真
   如果第一个条件为True，就不会再判断第二个条件
not 逻辑非 取反
"""

